jorgebucaran/fisher
oh-my-fish/plugin-brew
tuvistavie/fish-ssh-agent
kidonng/zoxide.fish
meaningful-ooo/sponge
z11i/github-copilot-cli.fish
joseluisq/gitnow
james2doyle/omf-plugin-artisan
edheltzel/fisher-plugin-macos
oh-my-fish/plugin-bang-bang
laughedelic/pisces
patrickf1/fzf.fish
