jorgebucaran/fisher
oh-my-fish/plugin-brew
meaningful-ooo/sponge
z11i/github-copilot-cli.fish
joseluisq/gitnow
james2doyle/omf-plugin-artisan
edheltzel/fisher-plugin-macos
oh-my-fish/plugin-bang-bang
laughedelic/pisces
danhper/fish-ssh-agent
vitallium/tokyonight-fish
dteoh/fish-set-lc-all
patrickf1/fzf.fish
jhillyerd/plugin-git
