jorgebucaran/fisher
meaningful-ooo/sponge
joseluisq/gitnow
edheltzel/fisher-plugin-macos
oh-my-fish/plugin-bang-bang
laughedelic/pisces
vitallium/tokyonight-fish
patrickf1/fzf.fish
