fisherman/await
oh-my-fish/plugin-bang-bang
edc/bass
oh-my-fish/plugin-brew
fisherman/last_job_id
fisherman/menu
oh-my-fish/plugin-osx
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-tab
publicarray/update
fisherman/z
orefalo/free
jorgebucaran/shark
laughedelic/pisces
oh-my-fish/plugin-grc

matchai/spacefish
