fisherman/await
oh-my-fish/plugin-bang-bang
edc/bass
oh-my-fish/plugin-brew
fisherman/fnm
fisherman/free
fisherman/get_file_age
oh-my-fish/plugin-grc
fisherman/last_job_id
fisherman/menu
oh-my-fish/plugin-osx
matchai/spacefish
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-tab
publicarray/update
fisherman/z
