fishpkg/fish-menu
oh-my-fish/plugin-brew
tuvistavie/fish-ssh-agent
orefalo/free
laughedelic/pisces
jethrokuan/z
oh-my-fish/plugin-osx
joseluisq/gitnow
edc/bass
jorgebucaran/nvm.fish
jorgebucaran/fisher
re3turn/fish-last-job-id
rbenv/fish-rbenv
oh-my-fish/plugin-bang-bang
andreiborisov/sponge
jorgebucaran/fish-bax
