fishpkg/fish-last-job-id
fishpkg/fish-menu
jorgebucaran/fish-bax
jorgebucaran/fisher
tuvistavie/fish-ssh-agent
orefalo/free
laughedelic/pisces
devert/plugin-avn
jethrokuan/z
rbenv/fish-rbenv
laughedelic/fish_logo
oh-my-fish/plugin-osx
edc/bass
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-brew
oh-my-fish/plugin-rustup
FabioAntunes/fish-nvm
