edc/bass
andreiborisov/sponge
jorgebucaran/autopair.fish
oh-my-fish/plugin-brew
rbenv/fish-rbenv
oh-my-fish/plugin-osx
re3turn/fish-last-job-id
tuvistavie/fish-ssh-agent
laughedelic/pisces
orefalo/free
joseluisq/gitnow
jorgebucaran/fisher
jethrokuan/fzf
jethrokuan/z
