oh-my-fish/plugin-bang-bang
edc/bass
oh-my-fish/plugin-brew
oh-my-fish/plugin-osx
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-tab
publicarray/update
orefalo/free
jorgebucaran/shark
laughedelic/pisces
oh-my-fish/plugin-grc
matchai/spacefish
fishpkg/fish-await
fishpkg/fish-menu
jethrokuan/z
fishpkg/fish-last-job-id
