###############################################################
# cspell: disable
# ~/.Brewfile - Software Installs for MacOS                   #
#                                                             #
# List of packages to be installed / updated via Homebrew     #
# Apps are sorted by category, and arranged alphabetically    #
# Be sure to delete / comment out anything you do not need    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile   #
# Source GH repository: https://github.com/edheltzel/Brewfile #
# See brew docs for more info: https://docs.brew.sh/Manpage   #
#                                                             #
# 1. Command Line                                             #
# 2. Software Dev                                             #
# 3. Desktop Apps                                             #
# 4. MacOS Specific Stuff                                     #
#                                                             #
###############################################################

# Options
cask_args appdir: '/Applications', require_sha: true

# Taps
tap 'buo/cask-upgrade' 					# Upgrade casks
tap 'eddieantonio/eddieantonio' # Eddie Antonio's Homebrew Tap
tap 'github/gh'									# Interact with GitHub PRs, issues, repos
tap 'kyoh86/tap' 								# for 'sd' - RegEx find and replace (better sed) - Rust
tap 'over-sh/bun' 							# All-in-one toolkit for JS/TS
tap 'sass/sass' 								# Sass
tap 'teamookla/speedtest'   		# Command line speed test utility
tap 'julien-cpsn/atac'          # A simple API client (postman like) in your terminal

#############################################################
# 1. Command Line                                           #
#############################################################
brew 'fish'                                 # My Default Shell
brew 'starship'                             # Cross-shell prompt - Rust
brew 'jandedobbeleer/oh-my-posh/oh-my-posh' # Cross-shell prompt - Go

# zsh plugins
brew 'zsh-syntax-highlighting'             # Syntax highlighting for zsh
brew 'zsh-autopair'                        # Auto-pairing for zsh
brew 'olets/tap/zsh-abbr'                  # Abbreviations for zsh

# CLI Essentials
brew 'git'          # Version control
brew 'neovim'       # Text editor
brew 'helix'        # Text editor
brew 'stow'         # Dotfile manager for symlinks
brew 'topgrade'     # Upgrade all the things - Rust
brew 'zellij'       # Terminal multiplexer (tmux replacement) - Rust


# CLI Basics
brew 'ack'                  # Search tool like grep, but faster
brew 'bat'                  # Output highlighting (better cat) - Rust
brew 'brew-cask-completion' # Fish shell completion for brew cask
brew 'broot'                # File tree explorer (better tree) - Rust
brew 'chafa'                # Image to ASCII art converter
brew 'assimp'               # Open source library to import various 3d-model-formats in an uniform manner
brew 'yazi'                 # File manager - Rust
brew 'coreutils'            # GNU core utilities (those that come with macOS are outdated)
brew 'duti'                 # Set default apps for file types
brew 'eza'                  # Listing files with info (better ls) replaces exa - Rust
brew 'fd'                   # Find files - Rust
brew 'fzf'                  # Fuzzy file finder and filtering - Go
brew 'grc'                  # Colorize terminal output
brew 'hexyl'                # Hex viewer - Rust
brew 'jq'                   # JSON parser, output and query files
brew 'mas'                  # Mac App Store CLI
brew 'most'                 # Multi-window scroll pager (better less)
brea 'poppler'              # PDF rendering library
brew 'ripgrep'              # Searching within files (better grep) - Rust
brew 'rsync'                # Fast incremental file transfer
brew 'sd'                   # RegEx find and replace (better sed) - Rust
brew 'sevenzip'             # 7-Zip file archiver
brea 'xen'                  # Terminal CSV Processing - Rust
brew 'zoxide'               # Auto-learning navigation (better cd/jump) - Rust --> fish plugin adds to PATH

# CLI Image Processing and Compression
brew 'ffmpegthumbnailer'    # Create thumbnails from videos
brew 'gdk-pixbuf'           # Image loading library
brew 'graphicsmagick'       # Image manipulation
brew 'imagemagick'          # Image manipulation
brew 'jpegoptim'            # JPEG image compression
brew 'mozjpeg'              # JPEG image compression
brew 'optipng'              # PNG image compression
brew 'pango'                # Text layout and rendering
brew 'glow'                 # Render markdown on the CLI

# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor
brew 'btop'         # Resource monitor
brew 'ctop'         # Container metrics and monitoring - Go
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'duf'          # Get info on mounted disks (better df) - Go
brew 'procs'        # Advanced process viewer (better ps) - Rust

# CLI Productivity Apps
brew 'rclone'       # Manage cloud storage
brew 'kondo'        # Clean up old files and directories - Rust
brew 'portal'       # file transfer utility - Go

# CLI Development Suits
brew 'lazydocker'   # Full Docker management app - Go
brew 'lazygit'        # TUI for git - Go

# CLI Docs and Cheatsheets
brew 'tealdeer'     # Read cheat sheets (better tldr) - Rust

# CLI Misc
brew 'figlet'        # Output text as big ASCII art text
brew 'fastfetch'     # Show system data and ditstro info - neofetch is archived

#############################################################
# 2. Software / Web Development                             #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew 'bun'                    # All-in-one toolkit for JS/TS
brew 'composer'               # PHP package manager
brew 'deno'                   # Deno JavaScript/TypeScript runtime
brew 'lucapette/tap/fakedata' # Generate fake data - Go
brew 'fnm'                    # Switching Node versions
brew 'go'                     # Compiler for Go Lang
brew 'hugo'                   # Static site generator - Go
brew 'lua'                    # Lua interpreter
brew 'luarocks'               # Package manager for Lua
brew 'mysql'                  # MySQL database engine
# brew 'node'                 # Node.js -->  Use fnm See packages/
brew 'php'                    # PHP
brew 'postgresql@14'          # PostgreSQL database engine
brew 'python'                 # Python 2
brew 'python3'                # Python 3
brew 'pipx'                   # Python - i dont use python
brew 'rbenv'                  # Ruby version manager
brew 'redis'                  # Redis database engine
brew 'ruby-build'             # Ruby build plugin for rbenv
brew 'richgo'                 # Go test output formatter/opt/homebrew/bin/fish
brew 'rust'                   # Rust language
brew 'rustup-init'            # Rust version manager
brew 'sass/sass/migrator'     # Sass mignration tool
brew 'sass/sass/sass'         # Sass CSS preprocessor
brew 'sqlite'                 # SQLite database engine
brew 'tdewolff/tap/minify'    # Minify HTML, CSS, JS, JSON, SVG, XML
brew 'zig'                    # Zig language

# DevOps SCMs and CI/CD Tools
brew 'curlie'             # Command line HTTP client - Go
brew 'httpie'             # Command line HTTP client
brew 'podman'             # Containers
brew 'orbstack'           # Docker image viewer
brew 'doctl'              # DigitalOcean CLI
brew 's3cmd'              # S3 command line tool
brew 'monolith'           # Save web pages as single files - Rust

# Development Utils
brew 'gh'                 # Interact with GitHub PRs, issues, repos
brew 'git-delta'          # Git diff viewer - Rust
brew 'git-extras'         # Extra git commands for common tasks
brew 'git-lfs'            # Git Large File Storage
brew 'miniserve'          # Static file server
brew 'mkcert'             # Local HTTPS development
brew 'scc'                # Source code counter - Go
brew 'tig'                # Text-mode interface for git
brew 'watchexec'          # Watch a directory and execute a command when files change
brew 'wget'               # wget with IRI support
brew 'zaquestion/tap/lab' # GitLab CLI
brew 'atac'               # A simple API client (postman like) in your terminal - Rust

# Network and Security Testing
brew 'bettercap'          # Network, scanning and moniroting
brew 'nmap'               # Port scanning
brew 'dnsmasq'            # DNS server used with Larvel Valet in ~/Sites
brew 'nginx'              # Web server used with Larvel Valet in ~/Sites
brew 'hyperfine'          # Benchmark command-line programs
cask 'wireshark'          # Network protocol analyzer
brew 'termshark'
cask 'lulu'               # LuLu - Open source firewall 

# Security Utilities
# brew 'bitwarden-cli'     # Bitwarden CLI - outdated - use https://github.com/bitwarden/cli/
# note: workaround - manually move the binary to /opt/homebrew/bin/bw
brew 'clamav'            # Open source virus scanning suite
brew 'gnupg'             # GNU Privacy Guard
brew 'lynis'             # Scan system for common security issues
brew 'nss'               # Network Security Services
brew 'openssl'           # Cryptography and SSL/TLS Toolkit
brew 'ssh-copy-id'       # Copy SSH keys to remote hosts
brew 'sshs'              # Terminal user interface for SSH - Rust
cask 'gpg-suite'         # GPG encryption files
brew 'age'               # Simple, modern and secure encryption tool - Go

#############################################################
# 3. Desktop Applications                                   #
#############################################################

# Creativity
cask 'adobe-creative-cloud' # Adobe Creative Cloud
cask 'affinity-designer'    # Illustrator replacement
cask 'affinity-publisher'   # InDesign replacement
cask 'affinity-photo'       # Photoshop replacement
cask 'figma'                # Design tool
cask 'nucleo'               # Icon manager
cask 'principle'            # Prototyping tool

# 3D Modeling & CAD
cask 'blender'              # 3D Software
cask 'openscad'             # 3D CAD Modeller
cask 'kicad'                # Electronics Design Automation - PCB design
cask 'freecad'              # 3D CAD - open source
cask 'autodesk-fusion'      # 3D CAD - freeware
cask 'bambu-studio'         # 3D Slicer
cask 'orcaslicer'           # 3D Slicer

# Media
cask 'boom'                 # Audio enhancer
cask 'iina'                 # Media player
cask 'kap'                  # Screen recorder
cask 'keycastr'             # Display keystrokes
brew 'pandoc'               # Universal file converter
cask 'vlc'                  # Media player
brew 'webp'                 # WebP image format
cask 'shottr'               # Screenshot and recorder app
cask 'obs'                  # Screen recorder
cask 'capcut'               # Video Editing
# Communication and Chat
cask 'discord'              # Chat app
cask 'chatgpt'              # ChatGPT app

# Personal Applications
cask 'bitwarden'            # Password manager
cask 'clickup'              # Project management
cask 'google-drive'         # Cloud storage
cask 'ledger-live'          # Crypto hardware wallet manager
cask 'brainfm'              # BrainFM - Music streaming

# Utility Applications
cask 'displaylink'               # DisplayLink drivers
brew 'm-cli'                     # All in one MacOS management CLI app: m help
cask 'onyx'                      # System maintenance
cask 'transnomino'               # A batch rename utility
brew 'shortcat'                  # vim motions for MacOS
cask 'mouseless'                 # Mouseless app for MacOS
# brew 'localsend'                 # AirDrop like app for everything else
cask 'openinterminal'            # Finder button, opens directory in terminal
cask 'itsycal'                   # Calendar in menubar
brew 'stats'                     # System stats in menubar
cask 'raycast', args: { require_sha: false }  # Spotlight/Alfred alternative
cask 'typinator'                 # Text expander - macOS only
cask 'keka'                      # File archiver and extractor

# Keyboard+Mouse Hacks
brew 'qmk/qmk/qmk'               # Keyboard firmware
cask 'via'                       # Keyboard configuration desktop client
cask 'vial'                      # Keyboard configuration desktop client
cask 'karabiner-elements'        # Keyboard customization tool

# Menu Bar Hacks
brew 'sketchybar'                # status bar replacement for MacOS - paired with Aerospace
brew 'jordanbaird-ice'           # Ice bar - Using Sketchybar currently

# Window Management & Tiling
# I now use native MacOS Stage Manager with Raycast window management
cask 'alt-tab'                   # Windows like alt-tab

# Browsers
cask 'choosy'                    # Choose which browser to open links in - Default
cask 'brave-browser@beta'        # Brave browser - Secondary
#cask 'firefox@nightly'          # Firefox Nightly - Tertiary
cask 'zen-browser'               # Zen Browser - Primary

# Fonts
cask 'font-symbols-only-nerd-font'    # Nerd Font Symbols Only

cask 'sf-symbols'
brew 'font-sf-pro'

cask 'font-inter'                     # Design font
cask 'font-geist'                     # Design font
cask 'font-lilex'                     # Design font
cask 'font-lilex-nerd-font'           # Dev/Terminal Font - Primary
cask 'font-commit-mono'               # Design font
cask 'font-commit-mono-nerd-font'     # Dev/Terminal Font - Tertiary
cask 'font-fira-code-nerd-font'       # Dev Font - Quaternary (4th)

# Development Apps
cask 'cyberduck'                      # Mount remote storage locations
cask 'dbngin'                         # Local MySQL database management
cask 'devtoys'                        # Dev tools/utilities for Mac
cask 'local'                          # Local WordPress development
cask 'sequel-ace'                     # MySQL database management
cask 'tableplus'                      # Database management
cask 'typora'                         # Markdown editor
cask 'visual-studio-code'             # Code editor - Default

# RAG+CAG LLM 
cask 'block-goose'                    # On Machine AI Agent
cask 'ollama'                         # Local LLMs 
brew 'ollama'

# Terminal emulators
cask 'wezterm'                        # Terminal emulator - Rust

#############################################################
# 4. MacOS Specific Stuff                                   #
#############################################################

# Mac OS Quick-Look Plugins
cask 'qlcolorcode'    # QL for code with highlighting
cask 'qlimagesize'    # QL for size info for images
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'quicklook-json', args: { require_sha: false } # QL for JSON, with trees
cask 'webpquicklook',  args: { require_sha: false } # QL for WebP image files

# Mac App Store Installs
mas 'Shapr3d', id: 1091675654
mas 'ColorSlurp', id: 1287239339
mas 'Amphetamine', id: 937984704
mas 'Icon Slate', id: 439697913
mas 'Invoice Ninja V5', id: 1503970375
mas 'Just Focus', id: 1142151959
mas 'Gifski', id: 1351639930
mas 'Qi FM', id: 147969619
mas 'ColorNoise', id: 1640045375
mas 'Todoist: To-Do List & Tasks', id: 585829637
mas 'Toggl Track: Hours & Time Log', id: 1291898086
#mas 'Xcode', id: 497799835
