# ##############################################################
# ~/.Brewfile - Software Installs for MacOS                   #
#                                                             #
# List of packages to be installed / updated via Homebrew     #
# Apps are sorted by category, and arranged alphabetically    #
# Be sure to delete / comment out anything you do not need    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile   #
# Source GH repository: https://github.com/edheltzel/Brewfile #
# See brew docs for more info: https://docs.brew.sh/Manpage   #
#                                                             #
# 1. Command Line                                             #
# 2. Software Dev                                             #
# 3. Desktop Apps                                             #
# 4. MacOS Specific Stuff                                     #
#                                                             # 
# ADE (AI/Agent Development Environment)                      #
###############################################################

# Options
cask_args appdir: '/Applications', require_sha: true

# Taps
tap 'buo/cask-upgrade'	# Upgrade casks
tap 'eddieantonio/eddieantonio' # Eddie Antonio's Homebrew Tap
tap 'github/gh'	# Interact with GitHub PRs, issues, repos
tap 'kyoh86/tap' 								# for 'sd' - RegEx find and replace (better sed) - Rust
tap 'over-sh/bun' 							# All-in-one toolkit for JS/TS
tap 'sass/sass'	# Sass
tap 'teamookla/speedtest'	# Command line speed test utility
tap 'julien-cpsn/atac'          # A simple API client (postman like) in your terminal
tap 'FelixKratz/formulae'       # A tap for Janky Borders see brew borders
tap 'marcus/tap'                # For sidecar and td
tap 'gromgit/brewtils'
tap 'rjyo/moshi'                # Moshi mobile SSH client host tools

#############################################################
# 1. Command Line                                           #
#############################################################
brew 'fish'                                 # My Default Shell
brew 'starship'                             # Cross-shell prompt - Rust
brew 'jandedobbeleer/oh-my-posh/oh-my-posh' # Cross-shell prompt - Go

# zsh plugins
brew 'antidote'                            # Zsh plugin manager (lightweight, no Oh My Zsh)
brew 'zsh-syntax-highlighting'             # Syntax highlighting for zsh
brew 'zsh-autopair'                        # Auto-pairing for zsh
brew 'olets/tap/zsh-abbr'                  # Abbreviations for zsh

# CLI Essentials
brew 'git'          # Version control
brew 'jj'           # Version control
brew 'lazyjj'       # TUI for jj (Jujutsu)
brew 'neovim'       # Text editor
brew 'stow'         # Dotfile manager for symlinks
brew 'topgrade'     # Upgrade all the things - Rust
brew 'herdr'        # Multiplexer for Agents
brew 'tmux'         # Multiplexer
brew 'taproom'      # TUI for homebrew

# CLI Basics
brew 'ast-grep'             # a faster grep
brew 'ack'                  # Search like grep, but faster
brew 'assimp'               # 3D model import tool
brew 'bat'                  # better cat - Rust
brew 'brew-cask-completion' # brew cask completion
brew 'chafa'                # image to ASCII art converter
brew 'coreutils'            # gnu core utilities (those that come with macOS are outdated)
brew 'cmake'                # cMake - cross-platform build system
brew 'csvlens'              # csv viewer
brew 'duti'                 # set default app for file types
brew 'eza'                  # better ls - Rust
brew 'fd'                   # better find - Rust
brew 'fzf'                  # fuzzy finder - Go
brew 'television'           # fuzzy finder - Rust
brew 'grc'                  # colorize terminal output
brew 'hexyl'                # hex viewer - Rust
brew 'jq'                   # json parser
brew 'just'                 # better make
brew 'mas'                  # Mac App Store CLI
brew 'most'                 # better less
brew 'ouch'                 # better zip/unzip - Rust
brew 'poppler'              # PDF rendering library
brew 'ripgrep'              # better grep - Rust
brew 'rsync'                # Fast incremental file transfer
brew 'sd'                   # better sed - Rust
brew 'yazi'                 # File manager - Rust
brew 'zoxide'               # better cd/jump - Rust

# CLI Image Processing and Compression
brew 'ffmpegthumbnailer'    # Create thumbnails from videos
brew 'gdk-pixbuf'           # Image loading library
brew 'graphicsmagick'       # Image manipulation
brew 'imagemagick'          # Image manipulation
brew 'jpegoptim'            # JPEG image compression
brew 'mozjpeg'              # JPEG image compression
brew 'optipng'              # PNG image compression
brew 'pango'                # Text layout and rendering
brew 'glow'                 # Render Markdown on the CLI
brew 'vhs'                  # Write terminal GIFs as code
brew 'tamnd/tap/kage'

# CLI Monitoring and Performance Apps
brew 'btop'         # better top
brew 'ctop'         # Container metrics/monitoring - Go
brew 'dua-cli'      # better du
brew 'duf'          # better df - Go
brew 'procs'        # better ps - Rust

# CLI Productivity Apps
brew 'rclone'       # Manage cloud storage
brew 'mole'         # Deep clean and optimize

# CLI Development Suits
brew 'lazydocker' # Full Docker management app - Go
brew 'lazygit' # TUI for git - Go

# CLI Docs and Cheat-sheets
brew 'tealdeer' # better tldr - Rust

# CLI Misc
brew 'figlet'        # Output text as big ASCII art text
brew 'fastfetch'     # Show system data and distro info

#############################################################
# 2. Software / Web Development                             #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew 'bun'                    # All-in-one toolkit for JS/TS
brew 'composer'               # PHP package manager
brew 'deno'                   # Deno JavaScript/TypeScript runtime
brew 'lucapette/tap/fakedata' # Generate fake data - Go
brew 'fnm'                    # Switching Node versions
brew 'go'                     # Compiler for Go Lang
brew 'lua'                    # Lua interpreter
brew 'luarocks'               # Package manager for Lua
brew 'mysql'                  # MySQL database engine

brew 'php'                    # PHP
brew 'postgresql@14'          # PostgreSQL database engine
brew 'python'                 # Python 2
brew 'python3'                # Python 3
brew 'pipx'                   # Python - i dont use python very often
brew 'rbenv'                  # Ruby version manager
brew 'redis'                  # Redis database engine
brew 'ruby-build'             # Ruby build plugin for rbenv
brew 'richgo'                 # Go test output formatter
brew 'rustup-init'            # Rust version manager
brew 'sass/sass/migrator'     # Sass migration tool
brew 'sass/sass/sass'         # Sass CSS pre-processor
brew 'sqlite'                 # SQLite database engine
brew 'tdewolff/tap/minify'    # Minify HTML, CSS, JS, JSON, SVG, XML
brew 'zig'                    # Zig language

# DevOps SCMs and CI/CD Tools
brew 'curlie'             # Command line HTTP client - Go
brew 'httpie'             # Command line HTTP client
brew 'orbstack'           # Docker image viewer
brew 'docker'
brew 'derailed/k9s/k9s'
brew 'container'          # Container CLI by Apple
brew 'doctl'              # DigitalOcean CLI
brew 's3cmd'              # S3 command line tool
brew 'monolith'           # Save web pages as single files - Rust
brew 'ghostscript'
brew 'tectonic'

# Development Utils
brew 'gh'                 # Interact with GitHub PRs, issues, repos
brew 'git-delta'          # Git diff viewer - Rust
brew  'modem-dev/tap/hunk'
brew 'git-extras'         # Extra git commands for common tasks
brew 'git-lfs'            # Git Large File Storage
brew 'miniserve'          # Static file server
brew 'mkcert'             # Local HTTPS development
brew 'scc'                # Source code counter - Go
brew 'tig'                # Text-mode interface for git
brew 'watchexec'          # Watch a directory and execute a command when files change
brew 'wget'               # wget with IRI support
brew 'atac'               # A simple API client (postman like) in your terminal - Rust

# Network and Security Testing
brew 'bettercap'          # Network, scanning and moniroting
brew 'nmap'               # Port scanning
brew 'dnsmasq'            # DNS server used with Larvel Valet in ~/Sites
brew 'nginx'              # Web server used with Larvel Valet in ~/Sites
brew 'hyperfine'          # Benchmark command-line programs
cask 'wireshark'          # Network protocol analyzer
brew 'termshark'
cask 'lulu'               # LuLu - Open source firewall

# Security Utilities
brew 'clamav'            # Open source virus scanning suite
brew 'gnupg'             # GNU Privacy Guard
brew 'lynis'             # Scan system for common security issues
brew 'nss'               # Network Security Services
brew 'openssl'           # Cryptography and SSL/TLS Toolkit
brew 'ssh-copy-id'       # Copy SSH keys to remote hosts
brew 'sshs'              # Terminal user interface for SSH - Rust
brew 'mosh'              # Mobile shell - roaming remote terminal over UDP
brew 'moshi-hook', restart_service: true # Moshi app agent hooks (rjyo/moshi)
cask 'gpg-suite'         # GPG encryption files
brew 'age'               # Simple, modern and secure encryption tool - Go
brew 'boring'

#############################################################
# 3. Desktop Applications                                   #
#############################################################

# Creativity
cask 'adobe-creative-cloud' # Adobe Creative Cloud
cask 'affinity'             # Affinity.studio
cask 'figma'                # Design tool
cask 'nucleo'               # Icon manager

# 3D Modeling & CAD
cask 'openscad'             # 3D CAD Modeller
cask 'freecad'              # 3D CAD - open source

# 3D Slicers
cask 'bambu-studio'
cask 'orcaslicer'
cask 'snapmaker-orca'

cask 'kicad'                # Electronics Design Automation - PCB design

# Media
cask 'boom-3d'              # Audio enhancer - paid
cask 'kap'                  # Screen recorder
brew 'pandoc'               # Universal file converter
cask 'vlc'                  # Media player
brew 'webp'                 # WebP image format
cask 'shottr'               # Screenshot and recorder app
cask 'bettershot'           # Screenshot and recorder app
cask 'obs'                  # Screen recorder
cask 'capcut'               # Video Editing

# Personal Applications
cask 'bitwarden'            # Password manager
cask 'google-drive'         # Cloud storage
cask 'ledger-live'          # Crypto hardware wallet manager

# Utility Applications
cask 'bettercmdtab'                # Replace for cmd+tab
brew 'm-cli'                       # All in one MacOS management CLI app: m help
cask 'keycastr'                    # Display keystrokes
cask 'transnomino'                 # A batch rename utility
cask 'itsycal'                     # Calendar in menubar
cask 'raycast', args: { require_sha: false } # Spotlight/Alfred alternative
cask 'keka'                        # File archive and extractor
cask 'homerow'                     # keyboard shortcuts for every button in macOS
brew 'thaw'                        # Ice bar - Using Sketchybar currently
brew 'stats'                       # System stats in menubar
cask 'tailscale-app'
cask 'tigervnc'

# Keyboard+Mouse Hacks
brew 'qmk/qmk/qmk'                 # Keyboard firmware
cask 'via'                         # Keyboard configuration desktop client
cask 'vial'                        # Keyboard configuration desktop client
cask 'bazecor'                     # Keyboard config for Dygma Defy keyboard

cask 'karabiner-elements'          # Keyboard customization tool - paid
cask 'leader-key'                  # Keyboard App launcher

# Window Management & Tiling
# cask 'nikitabobko/tap/aerospace'    # Window Management
# brew 'borders'                      # A window borders manager

# Browsers
cask 'choosy'                    # Choose which browser to open links in - Default
cask 'brave-browser'
cask 'helium-browser'
cask 'firefox'                   
cask 'google-chrome'             # For tests

# Fonts
cask 'sf-symbols'
brew 'font-sf-pro'
cask 'font-inter'                     
cask 'font-lilex'
cask 'font-lilex-nerd-font'           
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-fira-code-nerd-font'       
cask 'font-symbols-only-nerd-font'    # Nerd Font Symbols Only

# Development Apps
cask 'cyberduck'                      # Mount remote storage locations
cask 'obsidian'                       # PKM editor
cask 'sequel-ace'                     # MySQL database management
cask 'typora'                         # Markdown editor
cask 'zed'                            # Code editor - Rust

# AI tooling and ADEs (AI/Agent Development Environment)
cask 'ollama'
brew 'ollama'

cask 'superwhisper'                   # TTS app
cask 'claude'                         # Claude Desktop
cask 'claude-code'                    # Claude Code
cask 'codex'                          # Codex cli
cask 'codex-app'                      # Codex Desktop 
brew 'fabric-ai'
brew 'agent-browser'
brew 'whisper-cpp'
brew 'sox'
brew 'socat'
cask 'maestro'
brew 'can1357/tap/omp'

# Terminal emulators
cask 'ghostty'                        
# cask 'kitty'                        
# cask 'wezterm@nightly'              

#############################################################
# 4. MacOS Specific Stuff                                   #
#############################################################

# Mac OS Quick-Look Plugins
cask 'qlcolorcode'    # QL for code with highlighting
cask 'qlimagesize'    # QL for size info for images
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'quicklook-json', args: { require_sha: false } # QL for JSON, with trees
cask 'webpquicklook',  args: { require_sha: false } # QL for WebP image files

# Mac App Store Installs
mas 'Shapr3d', id: 1091675654
mas 'Invoice Ninja V5', id: 1503970375
mas 'Just Focus', id: 1142151959
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
